XML/new_create_hostedoffice_subscriber_lmi.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cai3="http://schemas.ericsson.com/cai3g1.2/">                                 
<soapenv:Header xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cai3="http://schemas.ericsson.com/cai3g1.2/">          
<cai3:SessionId>{0}</cai3:SessionId>
</soapenv:Header>
<soapenv:Body>                                   
    <cai3:Create xmlns:cai3="http://schemas.ericsson.com/cai3g1.2/">
    <ns1:MOType xmlns:ns1="http://schemas.ericsson.com/cai3g1.2/">IMSSubscription@http://schemas.ericsson.com/ema/UserProvisioning/IMS/5.0/</ns1:MOType>
    <cai3:MOId>
        <subscriberId>{1}{2}</subscriberId>
    </cai3:MOId>
    <cai3:MOAttributes>
        <createIMSSubscription>
            <subscriberId>{1}{2}</subscriberId>
            <subscriberBarringInd>FALSE</subscriberBarringInd>
            <defaultPrivateId>{1}{2}</defaultPrivateId>
            <chargingProfId>HostedOfficeChargingProfile</chargingProfId>
            <privacyIndicator>FALSE</privacyIndicator>
            <pubData>
              <publicIdValue>sip:{1}{2}</publicIdValue>
              <privateUserId>{1}{2}</privateUserId>
              <publicIdTelValue>tel:{1}</publicIdTelValue>
              <xcapAllowed>FALSE</xcapAllowed>
              <implicitRegSet>1</implicitRegSet>
              <isDefault>TRUE</isDefault>
              <configuredServiceProfiles>
                <configuredServiceProfileId>{3}</configuredServiceProfileId>
              </configuredServiceProfiles>
              <configuredServiceProfiles>
                <configuredServiceProfileId>{4}</configuredServiceProfileId>
              </configuredServiceProfiles>
            </pubData>
            <pubData>
              <publicIdValue>sip:{1}_sca_d{2}</publicIdValue>
              <xcapAllowed>FALSE</xcapAllowed>
              <implicitRegSet>2</implicitRegSet>
              <isDefault>TRUE</isDefault>
              <configuredServiceProfiles>
                <configuredServiceProfileId>{3}</configuredServiceProfileId>
              </configuredServiceProfiles>
              <configuredServiceProfiles>
                <configuredServiceProfileId>{4}</configuredServiceProfileId>
              </configuredServiceProfiles>
            </pubData>
            <pubData>
              <publicIdValue>sip:{1}_sca_m{2}</publicIdValue>
              <xcapAllowed>FALSE</xcapAllowed>
              <implicitRegSet>3</implicitRegSet>
              <isDefault>TRUE</isDefault>
              <configuredServiceProfiles>
                <configuredServiceProfileId>{3}</configuredServiceProfileId>
              </configuredServiceProfiles>
              <configuredServiceProfiles>
                <configuredServiceProfileId>{4}</configuredServiceProfileId>
              </configuredServiceProfiles>
            </pubData>
            <pubData>
              <publicIdValue>sip:{1}_sca_t{2}</publicIdValue>
              <xcapAllowed>FALSE</xcapAllowed>
              <implicitRegSet>4</implicitRegSet>
              <isDefault>TRUE</isDefault>
              <configuredServiceProfiles>
                <configuredServiceProfileId>{3}</configuredServiceProfileId>
              </configuredServiceProfiles>
              <configuredServiceProfiles>
                <configuredServiceProfileId>{4}</configuredServiceProfileId>
              </configuredServiceProfiles>
            </pubData>
            <pubData>
              <publicIdValue>sip:{1}_sca_1{2}</publicIdValue>
              <xcapAllowed>FALSE</xcapAllowed>
              <implicitRegSet>5</implicitRegSet>
              <isDefault>TRUE</isDefault>
              <configuredServiceProfiles>
                <configuredServiceProfileId>{3}</configuredServiceProfileId>
              </configuredServiceProfiles>
              <configuredServiceProfiles>
                <configuredServiceProfileId>{4}</configuredServiceProfileId>
              </configuredServiceProfiles>
            </pubData>
            <pubData>
              <publicIdValue>sip:{1}_sca_2{2}</publicIdValue>
              <xcapAllowed>FALSE</xcapAllowed>
              <implicitRegSet>6</implicitRegSet>
              <isDefault>TRUE</isDefault>
              <configuredServiceProfiles>
                <configuredServiceProfileId>{3}</configuredServiceProfileId>
              </configuredServiceProfiles>
              <configuredServiceProfiles>
                <configuredServiceProfileId>{4}</configuredServiceProfileId>
              </configuredServiceProfiles>
            </pubData>
            <pubData>
              <publicIdValue>sip:{1}_sca_3{2}</publicIdValue>
              <xcapAllowed>FALSE</xcapAllowed>
              <implicitRegSet>7</implicitRegSet>
              <isDefault>TRUE</isDefault>
              <configuredServiceProfiles>
                <configuredServiceProfileId>{3}</configuredServiceProfileId>
              </configuredServiceProfiles>
              <configuredServiceProfiles>
                <configuredServiceProfileId>{4}</configuredServiceProfileId>
              </configuredServiceProfiles>
            </pubData>
            <pubData>
              <publicIdValue>sip:{1}_sca_4{2}</publicIdValue>
              <xcapAllowed>FALSE</xcapAllowed>
              <implicitRegSet>8</implicitRegSet>
              <isDefault>TRUE</isDefault>
              <configuredServiceProfiles>
                <configuredServiceProfileId>{3}</configuredServiceProfileId>
              </configuredServiceProfiles>
              <configuredServiceProfiles>
                <configuredServiceProfileId>{4}</configuredServiceProfileId>
              </configuredServiceProfiles>
            </pubData>
            <pubData>
              <publicIdValue>sip:{1}_sca_5{2}</publicIdValue>
              <xcapAllowed>FALSE</xcapAllowed>
              <implicitRegSet>9</implicitRegSet>
              <isDefault>TRUE</isDefault>
              <configuredServiceProfiles>
                <configuredServiceProfileId>{3}</configuredServiceProfileId>
              </configuredServiceProfiles>
              <configuredServiceProfiles>
                <configuredServiceProfileId>{4}</configuredServiceProfileId>
              </configuredServiceProfiles>
            </pubData>
            <pubData>
              <publicIdValue>sip:{1}_sca_6{2}</publicIdValue>
              <xcapAllowed>FALSE</xcapAllowed>
              <implicitRegSet>10</implicitRegSet>
              <isDefault>TRUE</isDefault>
              <configuredServiceProfiles>
                <configuredServiceProfileId>{3}</configuredServiceProfileId>
              </configuredServiceProfiles>
              <configuredServiceProfiles>
                <configuredServiceProfileId>{4}</configuredServiceProfileId>
              </configuredServiceProfiles>
            </pubData>
            <pubData>
              <publicIdValue>sip:{1}_sca_7{2}</publicIdValue>
              <xcapAllowed>FALSE</xcapAllowed>
              <implicitRegSet>11</implicitRegSet>
              <isDefault>TRUE</isDefault>
              <configuredServiceProfiles>
                <configuredServiceProfileId>{3}</configuredServiceProfileId>
              </configuredServiceProfiles>
              <configuredServiceProfiles>
                <configuredServiceProfileId>{4}</configuredServiceProfileId>
              </configuredServiceProfiles>
            </pubData>
            <privateUser>
              <privateUserId>{1}{2}</privateUserId>
              <userPassword>{5}</userPassword>
              <roamingAllowed>FALSE</roamingAllowed>
              <allowedAuthMechanism>Digest</allowedAuthMechanism>
            </privateUser>
        </createIMSSubscription>
    </cai3:MOAttributes>
</cai3:Create>
</soapenv:Body>
</soapenv:Envelope>